<a href="https://colab.research.google.com/github/Konoko2004/TheProject/blob/main/Pandas%20Test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
print("This is a test")

In [1]:
import pandas as pd
import numpy as np

[1, 1, 1, 1, 1]

In [ ]:

#using pandas OrderedDict , we need to import OrderedDict first.

from collections import OrderedDict

Ordered_Dict = pd.DataFrame(OrderedDict([
  ("Name",["Winston","Byrion","William"]),
  ("Occupation",["Data Guy","Developer","Jobless"]),
  ("Age",[34,25,18])
  ]))

UnOrdered_Dict = pd.DataFrame(
    {'Name':['Rosaline','William','Kappanator'],
     'Age':[19,33,69],
     'Occupation': ['Chemist','Tech Guy','Memer'],
     },
     index = ["A","B","C"],
     columns = ['Name','Age','Occupation']
)


UnOrdered_Dict

         Name  Age Occupation
A    Rosaline   19    Chemist
B     William   33   Tech Guy
C  Kappanator   69      Memer

In [ ]:
#1 trick with bool Values returning index of a table
#using UnOrdered_Dict Table

#this will return index 0 and index 2. Note that the length of values in manual_bool_Values has to match the number of rows in UnOrdered_Dict
Manual_bool_values = [True,False,True]

UnOrdered_Dict[Manual_bool_values]

         Name  Age Occupation
A    Rosaline   19    Chemist
C  Kappanator   69      Memer

In [ ]:

s = pd.Series(['Winston',32],
              index = ['Person',"age"])

In [ ]:
nparray = np.array(["Kappa","Keepo"])
testing = pd.Series(nparray,
                    index = ['Meme1','Meme2'])

testing

Meme1    Kappa
Meme2    Keepo
dtype: object

In [ ]:
import yfinance as yf
import pandas as pd

In [ ]:
nio = yf.Ticker("NIO")
nio.history(period = "1y")
nio_data = nio.history(period = "1y")

#create high - low column
nio_data = pd.DataFrame(nio_data)
nio_data['Open/Close Diff'] = abs(nio_data['Open'] - nio_data['Close'])
#Return mean of Open/Close Diff
nio_mean = nio_data['Open/Close Diff'].mean()
#Return Rows where Open/Close Diff is greater than mean
nio_data[nio_data['Open/Close Diff'] > nio_mean]

                 Open       High  ...  Stock Splits  Open/Close Diff
Date                              ...
2020-07-07  11.260000  13.770000  ...             0         1.960000
2020-07-13  15.260000  16.440001  ...             0         1.420000
2020-07-20  11.420000  12.840000  ...             0         1.400000
2020-08-11  15.300000  15.450000  ...             0         2.310000
2020-08-25  15.080000  17.870001  ...             0         2.760000
...               ...        ...  ...           ...              ...
2021-04-30  37.730000  41.220001  ...             0         2.110001
2021-05-10  36.779999  36.790001  ...             0         2.449997
2021-05-11  32.450001  35.459999  ...             0         2.419998
2021-05-13  33.849998  34.270000  ...             0         2.629999
2021-05-14  31.940001  33.689999  ...             0         1.479998

[87 rows x 8 columns]

In [4]:
import datetime

#create dataframe with list
person = pd.DataFrame([['dyer','William','Dyer'],
                       ['pb','Frank','Pabodie'],
                       ['lake','Anderson','Lake'],
                       ['roe','Valentina','Roerich'],
                       ['danforth','Frank','Danforth']],
                      columns = ['ident','personal','family'])


survey = pd.DataFrame([[619,'dyer','rad',9.82],
                       [619,'dyer','sal',0.13],
                       [622,'dyer','rad',7.8],
                       [622,'dyer','sal',0.09],
                       [734,'pb','rad',8.41],
                       [734,'lake','sal',0.05],
                       [734,'pb','temp',-21.5],
                       [734,'pb','rad',7.22],
                       [735,None,'sal',0.06],
                       [751,'pb','rad',4.35],
                       [752,'lake','rad',2.19],
                       [837,'lake','rad',1.46],
                       [837,'roe','sal',22.5],
                       [844,'roe','rad',11.25]],
                      columns = ['taken','person','quant','reading'])


#create dataframe with dictionaries
site = pd.DataFrame({
                     'name':['DR-1','DR-3','DR-4'],
                     'lat' :[-49.85,-47.15,-48.87],
                     'long':[-128.57,-126.72,-123.4]
})

visited = pd.DataFrame({
                     'ident':[619,622,734,735,751,752,837,844],
                     'site' :['DR-1','DR-1','DR-3','DR-3','DR-3','DR-3','MSK-4','DR-1'],
                     'dated':[datetime.date(1927,2,8),datetime.date(1927,2,10),datetime.date(1939,1,7),datetime.date(1930,1,12),datetime.date(1930,2,26),None,datetime.date(1932,1,14),datetime.date(1932,3,22)]
})


survey

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     734     pb   rad     7.22
8     735   None   sal     0.06
9     751     pb   rad     4.35
10    752   lake   rad     2.19
11    837   lake   rad     1.46
12    837    roe   sal    22.50
13    844    roe   rad    11.25

In [14]:
visited_nd = visited.loc[[0,2,6],:]
o2o_merge = site.merge(visited_nd,how = 'inner',left_on = 'name',right_on = 'site')
o2o_merge

   name    lat    long  ident  site       dated
0  DR-1 -49.85 -128.57    619  DR-1  1927-02-08
1  DR-3 -47.15 -126.72    734  DR-3  1939-01-07